In [1]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.

In [2]:
import pandas as pd
data = {
    "name" : ["santosh" , "yadav" , "abc", "def"],
    "age" : [10,20,30,40],
    "num" : [1,2,3,4]
}
df = pd.DataFrame(data)

In [3]:
df.head()

      name  age  num
0  santosh   10    1
1    yadav   20    2
2      abc   30    3
3      def   40    4

In [4]:
df.describe()

             age       num
count   4.000000  4.000000
mean   25.000000  2.500000
std    12.909944  1.290994
min    10.000000  1.000000
25%    17.500000  1.750000
50%    25.000000  2.500000
75%    32.500000  3.250000
max    40.000000  4.000000

In [5]:
pd.isnull(df)

    name    age    num
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [6]:
df.loc[0:1]

      name  age  num
0  santosh   10    1
1    yadav   20    2

In [7]:
df.tail()

      name  age  num
0  santosh   10    1
1    yadav   20    2
2      abc   30    3
3      def   40    4

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [8]:
 index = [1,2,3,4,5]

data1 = {
        "a" : [1,2,3,4,5],
        "b" : [6,7,8,9,10],
        "c" : [11,12,13,14,15],
    "index" : [1,2,3,4,5]
}

df = pd.DataFrame(data1)

In [9]:
df.reindex(index=index)

     a     b     c  index
1  2.0   7.0  12.0    2.0
2  3.0   8.0  13.0    3.0
3  4.0   9.0  14.0    4.0
4  5.0  10.0  15.0    5.0
5  NaN   NaN   NaN    NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [10]:
data3 = {
        "index" : [1,2,3,4,5],
        "values" : [10,20,30,40,50],
        "binary" : [0,1,0,1,0]
}
df = pd.DataFrame(data3)
calculates = df["values"][0:3].sum()
calculates

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [11]:
data4 = {
        "index" : [1,2,3,4,5],
        "text" : ["Given a Pandas DataFrame" , "write a Python function to" , "write a Python function to" , "create a new column Word_Count",
                 "that contains the number of"]
}

df = pd.DataFrame(data4)
df

   index                            text
0      1        Given a Pandas DataFrame
1      2      write a Python function to
2      3      write a Python function to
3      4  create a new column Word_Count
4      5     that contains the number of

In [12]:
df["word_count"] =df["text"].str.count(" ")

In [13]:
df

   index                            text  word_count
0      1        Given a Pandas DataFrame           3
1      2      write a Python function to           4
2      3      write a Python function to           4
3      4  create a new column Word_Count           4
4      5     that contains the number of           4

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [14]:
print(df.shape)
#Number of row and col in the DataFrame

(5, 3)

In [15]:
df.size
#Number of elements in the array.

15

Q6. Which function of pandas do we use to read an excel file?

In [16]:
# pd.read_excel("path")

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [17]:
data5 = {
        "index" : [1,2,3,4,5],
        "E-mail" : ["santosh@hotmail.com" , "yadav@gmail.com" , "vrinda@live.com" , "name@yahoo.com" , "us@hotmail.com"]
}

df = pd.DataFrame(data5)
df

   index               E-mail
0      1  santosh@hotmail.com
1      2      yadav@gmail.com
2      3      vrinda@live.com
3      4       name@yahoo.com
4      5       us@hotmail.com

In [18]:
df["E-mail"].str.split("@")[3][0]

'name'

In [19]:
username = []
for i in range(len(df["E-mail"])):
    x = df["E-mail"].str.split("@")[i]
    y = x[0]
    username.append(y)
df["username"] = username
df

   index               E-mail username
0      1  santosh@hotmail.com  santosh
1      2      yadav@gmail.com    yadav
2      3      vrinda@live.com   vrinda
3      4       name@yahoo.com     name
4      5       us@hotmail.com       us

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [20]:
data6 = {
    "A" : [3,8,6,2,9],
    "B" : [5,2,9,3,1],
    "C" : [1,7,4,5,2],
}
df = pd.DataFrame(data6)
df[(df["A"] > 5) & (df["B"] < 10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [21]:
print("mean : " , df.mean())
print("median : " , df.median())
print("std : " , df.std())

mean :  A    5.6
B    4.0
C    3.8
dtype: float64
median :  A    6.0
B    3.0
C    4.0
dtype: float64
std :  A    3.049590
B    3.162278
C    2.387467
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [26]:
def fun(df):
    df["date"] = pd.to_datetime( df["date"])
    df.sort_values("date" , inplace=True)
    
    df["MovingAverage"] = df["sale"].rolling(window=7, min_periods=1).mean()
    return df

df = pd.DataFrame({'date': ['2023-07-01', '2023-07-02', '2023-07-03', '2023-07-04', '2023-07-05', '2023-07-06', '2023-07-07', '2023-07-08'],
                   'sale': [10, 12, 8, 14, 6, 9, 11, 13]})

In [27]:
fun(df)

        date  sale  MovingAverage
0 2023-07-01    10      10.000000
1 2023-07-02    12      11.000000
2 2023-07-03     8      10.000000
3 2023-07-04    14      11.000000
4 2023-07-05     6      10.000000
5 2023-07-06     9       9.833333
6 2023-07-07    11      10.000000
7 2023-07-08    13      10.428571

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [38]:
df = pd.DataFrame({ "date" : ["2023-01-01" , "2023-01-02" , "2023-01-03" , "2023-01-04" , "2023-01-05"],
                   "number" : [1,2,3,4,5]
})
df["date"] = pd.to_datetime(df["date"])

In [39]:
df["Weekday"] = df['date'].dt.day_name()

In [40]:
df

        date  number    Weekday
0 2023-01-01       1     Sunday
1 2023-01-02       2     Monday
2 2023-01-03       3    Tuesday
3 2023-01-04       4  Wednesday
4 2023-01-05       5   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [46]:
df = pd.DataFrame({
                "date" : ["2023-01-01", "2023-01-05", "2023-01-10", "2023-01-15", "2023-01-20" ,"2023-01-25" ,
                          "2023-01-31" ,"2023-02-01" ,"2023-02-01", "2023-02-01" ,"2023-02-01"],
                "xyz" : [1,2,3,4,5,6,7,8,9,10,11]    
})

df["date"] = pd.to_datetime(df["date"])
df[df["date"] < "2023-01-31"]

        date  xyz
0 2023-01-01    1
1 2023-01-05    2
2 2023-01-10    3
3 2023-01-15    4
4 2023-01-20    5
5 2023-01-25    6

In [43]:
df[]

         date  xyz
0  2023-01-01    1
1  2023-01-01    2
2  2023-01-01    3
3  2023-01-01    4
4  2023-01-01    5
5  2023-01-01    6
6  2023-01-01    7
7  2023-01-01    8
8  2023-01-01    9
9  2023-01-01   10
10 2023-01-01   11

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [47]:
# numpy